sysbenchOutputs/results_10_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      190.70
    writes/s:                     127.19
    fsyncs/s:                     447.75

Throughput:
    read, MiB/s:                  2.98
    written, MiB/s:               1.99

General statistics:
    total time:                          30.1964s
    total number of events:              21842

Latency (ms):
         min:                                    0.00
         avg:                                   13.75
         max:                                  281.54
         95th percentile:                       68.05
         sum:                               300378.85

Threads fairness:
    events (avg/stddev):           2184.2000/84.77
    execution time (avg/stddev):   30.0379/0.00