sysbenchOutputs/results_11_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 11
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      198.81
    writes/s:                     132.65
    fsyncs/s:                     469.41

Throughput:
    read, MiB/s:                  3.11
    written, MiB/s:               2.07

General statistics:
    total time:                          30.1664s
    total number of events:              22754

Latency (ms):
         min:                                    0.00
         avg:                                   14.51
         max:                                  257.74
         95th percentile:                       70.55
         sum:                               330229.49

Threads fairness:
    events (avg/stddev):           2068.5455/126.62
    execution time (avg/stddev):   30.0209/0.00