sysbenchOutputs/results_13_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 13
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 800KiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      216.76
    writes/s:                     144.67
    fsyncs/s:                     516.39

Throughput:
    read, MiB/s:                  3.39
    written, MiB/s:               2.26

General statistics:
    total time:                          30.1542s
    total number of events:              24809

Latency (ms):
         min:                                    0.00
         avg:                                   15.73
         max:                                  306.57
         95th percentile:                       73.13
         sum:                               390250.81

Threads fairness:
    events (avg/stddev):           1908.3846/133.31
    execution time (avg/stddev):   30.0193/0.02