sysbenchOutputs/results_17_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 17
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      199.00
    writes/s:                     132.83
    fsyncs/s:                     492.85

Throughput:
    read, MiB/s:                  3.11
    written, MiB/s:               2.08

General statistics:
    total time:                          30.4339s
    total number of events:              22925

Latency (ms):
         min:                                    0.00
         avg:                                   22.25
         max:                                  358.63
         95th percentile:                       95.81
         sum:                               510151.04

Threads fairness:
    events (avg/stddev):           1348.5294/98.44
    execution time (avg/stddev):   30.0089/0.00