sysbenchOutputs/results_19_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 19
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      208.92
    writes/s:                     139.34
    fsyncs/s:                     525.94

Throughput:
    read, MiB/s:                  3.26
    written, MiB/s:               2.18

General statistics:
    total time:                          30.1467s
    total number of events:              23925

Latency (ms):
         min:                                    0.00
         avg:                                   23.85
         max:                                  297.46
         95th percentile:                      104.84
         sum:                               570522.17

Threads fairness:
    events (avg/stddev):           1259.2105/106.23
    execution time (avg/stddev):   30.0275/0.00