sysbenchOutputs/results_2_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      176.28
    writes/s:                     117.52
    fsyncs/s:                     380.68

Throughput:
    read, MiB/s:                  2.75
    written, MiB/s:               1.84

General statistics:
    total time:                          30.2899s
    total number of events:              20176

Latency (ms):
         min:                                    0.00
         avg:                                    2.97
         max:                                  122.46
         95th percentile:                       15.27
         sum:                                59987.26

Threads fairness:
    events (avg/stddev):           10088.0000/241.00
    execution time (avg/stddev):   29.9936/0.00