sysbenchOutputs/results_30_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 30
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 800KiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      208.78
    writes/s:                     139.40
    fsyncs/s:                     570.52

Throughput:
    read, MiB/s:                  3.26
    written, MiB/s:               2.18

General statistics:
    total time:                          30.4407s
    total number of events:              24129

Latency (ms):
         min:                                    0.01
         avg:                                   37.35
         max:                                  451.60
         95th percentile:                      158.63
         sum:                               901300.54

Threads fairness:
    events (avg/stddev):           804.3000/55.97
    execution time (avg/stddev):   30.0434/0.03