sysbenchOutputs/results_30_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 30
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      204.72
    writes/s:                     136.53
    fsyncs/s:                     559.39

Throughput:
    read, MiB/s:                  3.20
    written, MiB/s:               2.13

General statistics:
    total time:                          30.4728s
    total number of events:              23608

Latency (ms):
         min:                                    0.01
         avg:                                   38.19
         max:                                  443.22
         95th percentile:                      161.51
         sum:                               901489.66

Threads fairness:
    events (avg/stddev):           786.9333/70.39
    execution time (avg/stddev):   30.0497/0.03