sysbenchOutputs/results_31_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 31
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      197.62
    writes/s:                     131.75
    fsyncs/s:                     551.39

Throughput:
    read, MiB/s:                  3.09
    written, MiB/s:               2.06

General statistics:
    total time:                          30.3580s
    total number of events:              22773

Latency (ms):
         min:                                    0.00
         avg:                                   40.89
         max:                                  463.86
         95th percentile:                      170.48
         sum:                               931270.63

Threads fairness:
    events (avg/stddev):           734.6129/75.59
    execution time (avg/stddev):   30.0410/0.02