sysbenchOutputs/results_31_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 31
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      203.98
    writes/s:                     136.32
    fsyncs/s:                     565.96

Throughput:
    read, MiB/s:                  3.19
    written, MiB/s:               2.13

General statistics:
    total time:                          30.2650s
    total number of events:              23462

Latency (ms):
         min:                                    0.00
         avg:                                   39.71
         max:                                  499.95
         95th percentile:                      167.44
         sum:                               931649.32

Threads fairness:
    events (avg/stddev):           756.8387/74.22
    execution time (avg/stddev):   30.0532/0.03