sysbenchOutputs/results_32_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      206.20
    writes/s:                     137.58
    fsyncs/s:                     575.17

Throughput:
    read, MiB/s:                  3.22
    written, MiB/s:               2.15

General statistics:
    total time:                          30.2489s
    total number of events:              23704

Latency (ms):
         min:                                    0.00
         avg:                                   40.52
         max:                                  425.20
         95th percentile:                      170.48
         sum:                               960514.62

Threads fairness:
    events (avg/stddev):           740.7500/61.28
    execution time (avg/stddev):   30.0161/0.01